StratifyLabs/MIMXRT1050-EVK/src/SystemClock_Config.c

#include <sos/sos.h>
#include <mcu/arch.h>
#include <mcu/arch/imxrt/mimxrt1052/fsl_common.h>

#define BOARD_XTAL0_CLK_HZ 24000000U

static void BOARD_BootClockGate(void);
static void BOARD_BootClockRUN(void);

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* ARM PLL configuration for RUN mode */
const clock_arm_pll_config_t armPllConfig = {.loopDivider = 100U};

/* SYS PLL configuration for RUN mode */
const clock_sys_pll_config_t sysPllConfig = {.loopDivider = 1U};

/* USB1 PLL configuration for RUN mode */
const clock_usb_pll_config_t usb1PllConfig = {.loopDivider = 0U};

/*******************************************************************************
 * Variables
 ******************************************************************************/
/* System clock frequency. */
extern uint32_t SystemCoreClock;

/*******************************************************************************
 * Code
 ******************************************************************************/

/*******************************************************************************
 ************************ BOARD_InitBootClocks function ************************
 ******************************************************************************/
void SystemClock_Config(void)
{
	BOARD_BootClockRUN();
}

static void BOARD_BootClockGate(void)
{
	/* Disable all unused peripheral clock */
	CCM->CCGR0 = 0x00C0000FU;
	CCM->CCGR1 = 0x30000000U;
	CCM->CCGR2 = 0xFF3F303FU;
	CCM->CCGR3 = 0xF0000330U;
	CCM->CCGR4 = 0x0000FF3CU;
	CCM->CCGR5 = 0xF003330FU;
	CCM->CCGR6 = 0x00FC0F00U;
}

void BOARD_BootClockRUN(void)
{
	/* Boot ROM did initialize the XTAL, here we only sets external XTAL OSC freq */


	CLOCK_SetXtalFreq(24000000U);
	CLOCK_SetRtcXtalFreq(32768U);


	CLOCK_SetMux(kCLOCK_PeriphClk2Mux, 0x1); /* Set PERIPH_CLK2 MUX to OSC */
	CLOCK_SetMux(kCLOCK_PeriphMux, 0x1);     /* Set PERIPH_CLK MUX to PERIPH_CLK2 */

	/* Setting the VDD_SOC to 1.5V. It is necessary to config AHB to 600Mhz */
	DCDC->REG3 = (DCDC->REG3 & (~DCDC_REG3_TRG_MASK)) | DCDC_REG3_TRG(0x12);


	CLOCK_InitArmPll(&armPllConfig); /* Configure ARM PLL to 1200M */

#ifndef SKIP_SYSCLK_INIT
	CLOCK_InitSysPll(&sysPllConfig); /* Configure SYS PLL to 528M */
#endif
#ifndef XIP_EXTERNAL_FLASH
	//CLOCK_InitUsb1Pll(&usb1PllConfig); /* Configure USB1 PLL to 480M */
#endif
	CLOCK_SetDiv(kCLOCK_ArmDiv, 0x1); /* Set ARM PODF to 0, divide by 2 */
	CLOCK_SetDiv(kCLOCK_AhbDiv, 0x0); /* Set AHB PODF to 0, divide by 1 */
	CLOCK_SetDiv(kCLOCK_IpgDiv, 0x3); /* Set IPG PODF to 3, divede by 4 */

	CLOCK_SetMux(kCLOCK_PrePeriphMux, 0x3); /* Set PRE_PERIPH_CLK to PLL1, 1200M */
	CLOCK_SetMux(kCLOCK_PeriphMux, 0x0);    /* Set PERIPH_CLK MUX to PRE_PERIPH_CLK */

	/* Disable unused clock */
	//BOARD_BootClockGate(); //this needs to be updated StratifyOS

	/* Power down all unused PLL */
	CLOCK_DeinitAudioPll();
	CLOCK_DeinitVideoPll();
	CLOCK_DeinitEnetPll();
	CLOCK_DeinitUsb2Pll();

	/* Configure UART divider to default */
	CLOCK_SetMux(kCLOCK_UartMux, 0); /* Set UART source to PLL3 80M */
	CLOCK_SetDiv(kCLOCK_UartDiv, 0); /* Set UART divider to 1 */

	/* Update core clock */
	SystemCoreClockUpdate();
}
